app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "employees" SET "is_active" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["is_active", 0], ["updated_at", "2023-10-25 10:20:23.910230"], ["id", 1]]
UPDATE "employees" SET "is_active" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["is_active", 1], ["updated_at", "2023-10-25 12:09:41.967994"], ["id", 1]]
---
    def activity
        @employee = Employee.find(params[:id])
        if @employee.is_active
            @employee.update(is_active: false)
            redirect_to employees_path
        else
            @employee.update(is_active: true)

INSERT INTO "employees" ("emp_id", "name", "date_of_joining", "leaves", "company", "department", "is_active", "created_at", "updated_at", "manager_id", "is_manager") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
    def create
        @employee = Employee.new(employee_params)
        @employee.save

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 5]]
---
    def destroy
        puts "Inside destroy"
        @employee = Employee.find(params[:id])
        @employee.destroy

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "employees" SET "name" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["name", "Sarthak Mehra"], ["updated_at", "2023-10-25 07:09:41.464023"], ["id", 4]]
---
    def update
        @employee = Employee.find(params[:id])
        @employee.update(employee_params)

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def manager
        @manager = Employee.find(params[:id]).manager